[
 
  {
    "title": "Техническое задание",
    "body": "Работа с заказчиком начинается с заполнения брифа, в котором заказчик излагает свои пожелания относительно визуального представления и структуры сайта, указывает на ошибки в старой версии сайта, приводит примеры сайтов конкурентов. Исходя из брифа, менеджер составляет техническое задание, учитывая возможности программных и дизайнерских средств. Этап заканчивается после утверждения технического задания заказчиком. Важно сразу отметить, что этапы проектирования веб-сайтов зависят от многих факторов, таких как объём сайта, функциональность, задачи, которые должен выполнять будущий ресурс и многое другое. Однако, есть несколько этапов, которые в обязательном порядке присутствуют в планировании любого проекта. В результате в документе, где описано техническое задание, могут быть следующие основные разделы: 1. Цели и назначение сайта. 2. Аудитория сайта. 3. Технические характеристики. 4. Содержание сайта (структура сайта с подробным описанием элементов и функций каждой страницы). 5. Интерактивные элементы и сервисы (формы обратной связи, поиск на сайте, форум на сайте). 6. Формы (отправки на почту, подписки на рассылку, обратной связи). 7. Система управления содержимым (контентом). 8. Требования к материалам. 9. Перенос на хостинг.",
    "href": "https://ru.wikipedia.org"
  },
  {
    "title": "HTML-верстка",
    "body": "Утверждённый дизайн передаётся HTML-верстальщику, который «нарезает» графическую картинку на отдельные рисунки, из которых впоследствии складывает HTML-страницу. В результате создаётся код, который можно просматривать с помощью браузера. А типовые страницы впоследствии будут использоваться как шаблоны.",
    "href": "https://ru.wikipedia.org"
  },
  {
    "title": "Программирование",
    "body": "Далее готовые HTML-файлы передают программисту. Программирование сайта может осуществляться как «с нуля», так и на основе CMS — системы управления сайтом. Веб-разработчики часто называют CMS «движком». В случае с CMS надо сказать, что сама «CMS» в некотором смысле это готовый сайт, состоящий из заменяемых частей. «Программист» — в данном случае правильно будет назвать его просто специалистом по CMS — должен заменить стандартный шаблон, поставлявшийся с CMS, на оригинальный шаблон. Этот оригинальный шаблон он и должен создать на основе исходного «веб-дизайна». При программировании сайта специалисту назначаются контрольные точки сроков.",
    "href": "https://ru.wikipedia.org"
  },
  {
    "title": "тестирование",
    "body": "Процесс тестирования может включать в себя самые разнообразные проверки: вид страницы с увеличенными шрифтами, при разных размерах окна браузера[1], при отсутствии флэш-плеера и многие другие. Также — юзабилити-тестирование. Обнаруженные ошибки отправляются на исправление до тех пор, пока не будут устранены. Сроки контролирует менеджер проекта. Также, на этом этапе привлекают к работе дизайнера, чтобы он провёл авторский надзор.",
    "href": "https://ru.wikipedia.org"
  },
  {
    "title": "Размещение сайта в Интернет",
    "body": "Файлы сайта размещают на сервере провайдера (хостинга) и производят нужные настройки. На этом этапе сайт пока закрыт для посетителей.",
    "href": "https://ru.wikipedia.org"
  },
  {
    "title": "Наполнение контентом и публикация",
    "body": "Сайт наполняют содержимым (контентом) — текстами, изображениями, файлами для скачивания и так далее. Иногда тексты составляются специалистом студии, иногда контентом занимается ответственное лицо со стороны заказчика. Это решается на этапе составления технического задания. В случае, если контент составляется представителем студии, то это происходит и утверждается параллельно с другими этапами проекта. На каждой странице находятся текстовые блоки, они могут быть типовыми (стандартные) и не типовыми. Как правило нетиповой текстовый блок расположен на странице 404.",
    "href": "https://ru.wikipedia.org"
  },
  {
    "title": "Внутренняя SEO-оптимизация",
    "body": "Связана с некоторыми изменениями самого сайта. SEO-оптимизация начинается с определения семантического ядра. Здесь определяются такие ключевые слова, которые привлекут наиболее заинтересованных посетителей, по которым выиграть конкуренцию проще. Затем эти слова вносятся на сайт. Тексты, ссылки, другие теги адаптируются так, чтобы поисковые системы могли их успешно находить по ключевым словам.",
    "href": "https://ru.wikipedia.org"
  },
  {
    "title": "Внешняя SEO-оптимизация",
    "body": "Сводится, как правило, к построению структуры входящих ссылок. Это, собственно, и есть раскрутка сайта. К разработке сайта внешняя SEO-оптимизация не имеет отношения. SEO-оптимизация классифицируется на «белую» и «черную» (такую, после которой сайт за две недели попадает в топ, а потом в бан поисковиков). Настоящая, «белая» SEO-оптимизация, это трудоёмкий и долгий процесс, стоимость которого может в несколько раз превышать расходы на создание сайта.",
    "href": "https://ru.wikipedia.org"
  },
  {
    "title": "Сдача проекта",
    "body": "Заказчик или его доверенное лицо просматривают готовый проект и в случае, если все устраивает, то подписывают документы о сдаче проекта. Также, на этом этапе производится обучение представителя заказчика навыкам работы в администраторской зоне сайта.",
    "href": "https://ru.wikipedia.org"
  },
  {
    "title": "",
    "body": "",
    "href": ""
  },
  {
    "title": "",
    "body": "",
    "href": ""
  },
  {
    "title": "",
    "body": "",
    "href": ""
  }
]


